#!/bin/bash
echo What time is it? 
sleep 1
x=`date | grep -E -o "(Mon|Tue|Wed|Thu|Fri|Sut|Sun)"`
case $x in
        Mon)
                echo "Сегодня Понедельник"
                sleep 0.2
                echo' ,---------------------------.              '
                echo' | Лодырь  и  бездельник  !  |     ...      '
                echo' |им праздник и в понедельник|    (o -)     '
                echo' `--------------------------` ooO--(_)--Ooo-'
        ;;
        Tue)
                echo  "Сегодня Вторник "
                sleep 0.2
                echo' ,---------------------------.              '
                echo' |   Вторник - повторник !   |     ...      '
                echo' `--------------------------(_    (o -)     '
                echo' ---------------------------  ooO--(_)--Ooo-'
        ;;
        Wed)
                echo  'Сегодня Среда'
                sleep 0.2
                echo ' ,---------------------------.               '
                echo ' | Среда длиннее пятницы. !  |     ...       '
                echo ' `--------------------------(_    (o -)      '
                echo ' ---------------------------  ooO--(_)--Ooo- '
        ;;
        Thu)
                echo  "Сегодня Четверг"
                sleep 0.2
                echo' ,---------------------------.              '
                echo' | Неделя четвергом крепка ! |     ...      '
                echo' |    а жизнь половиною      |    (o -)     '
                echo' `-------------------------- `ooO--(_)--Ooo-'
        ;;
        Fri)
                echo  "Сегодня Пятница"
                sleep 0.2
                echo ' ,---------------------------.              '
                echo ' |Из под пятницы суббота видна|    ...      '
                echo ' `--------------------------(_    (o -)     '
                echo ' ---------------------------  ooO--(_)--Ooo-'
        ;;
        Sut)
                echo -n "Сегодня Суббота"
                sleep 0.2
                echo' ,---------------------------.              ' 
                echo' | Суббота для человека !    |     ...      '
                echo' | а не человек для субботы  |    (o -)     '
                echo' `-------------------------- `ooO--(_)--Ooo-'
        ;;
        Sun)
                echo -n "Сегодня Воскресенье"
                sleep 0.2 
                echo  ',---------------------------.               '
                echo  '| Воскресенье день веселья! |      ...      '
                echo  ' `--------------------------(_    (o -)     '
                echo  ' ---------------------------  ooO--(_)--Ooo-'
        ;;
esac

